{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"8cb8f591-f224-59a8-921f-a48e2be65616","html":"<p>Não consegui achar uma ferramenta de blog que tivesse um editor de Markdown competente. Ambos <a href=\"https://wordpress.com\">Wordpress</a> e <a href=\"https://tumblr.com\">Tumblr</a> prometem a ferramenta, mas apresentam de forma super pobre. <a href=\"%7B%25%20post_url%202016-12-11-mudanca-de-host%20%25%7D\">Como já disse antes</a> eu entendo que o público alvo desses sites são muito amplos para atender esse tipo de especificação, então eu achei melhor mudar de vez de ferramenta.</p>\n<!--more-->\n<p>Eu já havia flertado com o <a href=\"https://jekyllrb.com/\">Jekyll</a> antes, mas achava muito complicado, sem sequer testar. Eu fiquei positivamente surpreso ao descobrir o quão fácil é fazê-lo funcionar. Eu tive uns problemas por usar Windows, mas isso eu já esperava.</p>\n<p>O guia no site do Jekyll é bem simples de usar. Eu instalei o ruby via <a href=\"https://chocolatey.org/\">Chocolatey</a> e o resto foi bem simples, apesar de trabalhoso.</p>\n<p>{% include image name=“07hxUuB.png” %}</p>\n<p>O mais chato foi ter que adicionar variáveis de sistema no Windows, algo que nunca precisei, mas que é necessário para que o certificado SSL não dê erros. Peguei um certificado <a href=\"https://curl.haxx.se/ca/cacert.pem\">daqui</a> e coloquei como variável do sistema. Também <a href=\"https://github.com/settings/tokens/new\">gerei um token</a> pro Jekyll no github.</p>\n<p>{% include image name=“NNuosui.png” %}</p>\n<p>{% include image name=“pZQ0UKY.png” %}</p>\n<p>Além disso, tive que instalar o <a href=\"https://rubyinstaller.org/downloads/\">Ruby Dev Kit</a> e fazê-lo funcionar com o Ruby da máquina, o que pareceu complicado, mas não foi nada de outro mundo - basta fazer rodá-lo com o path da máquina.</p>\n<p>Para melhorar o visual do blog eu também fiz várias alterações no tema padrão <a href=\"https://github.com/jekyll/minima\">minima</a>, colocando alguns extras do tema <a href=\"https://aweekj.github.io/Kiko-plus/\">Kiko Plus</a>.</p>\n<p>Tenho agora um blog mais completo, que posso escrever diretamente no <a href=\"https://www.sublimetext.com/3\">Sublime</a> ou qualquer outro editor, como o <a href=\"https://code.visualstudio.com\">Visual Studio Code</a>, que tenho usado bastante. E o melhor, com Markdown completo, com block de código colorido e sem frescura. Também tenho o poder de colocar imagens no <a href=\"https://puush.me\">Puush</a> como já estava fazendo e comentários com o <a href=\"https://disqus.com\">Disqus</a>.</p>\n<p>O último passo será colocar o <a href=\"https://www.ampproject.org\">Google AMP</a> e fazer deploy do site no Github apenas do site publicado e não com o source todo. Esses eu planejo fazer mais pra frente, já que o AMP é super limitado e o deploy no Github tirar parte da praticidade de só escrever documentos no Jekyll.</p>","frontmatter":{"title":"Migrado para o Jekyll e Github Pages","date":"December 13, 2016"}}},"pageContext":{"slug":"/2016-12-13-migrado-para-jekyll-github-pages/","previous":{"fields":{"slug":"/2016-12-15-imagens-locais/"},"frontmatter":{"title":"Imagens locais"}},"next":null}}