{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"bb25bf9f-c776-5b99-9753-fab0b7e1d232","html":"<p>Estou estudando a possibilidade de mudança de host. A vida toda acostumei em ter o próprio servidor VPS, porém como atualmente estou falido, não estou podendo. Sempre hospedei meus sites do meu jeito, com meus softwares e o Wordpress ou <a href=\"https://ghost.org\" target=\"_blank\">Ghost</a> foram ferramentas que usei no passado que ajudaram muito. Entretanto essa versão pública do Wordpress é muito pobre no editor markdown, o que me deixa muito insatisfeito.</p>\n<!--more-->\n<p>Tentei outras ferramentas já como o <a href=\"https://tumblr.com\" target=\"_blank\">Tumblr</a> e o <a href=\"https://medium.com\" target=\"_blank\">Medium</a>, mas eles também deixam muito a desejar. Eu entendo que o público alvo desses sites esperam um editor mais visual e mais com a cara deles, algo que não tem nada a ver comigo infelizmente.</p>\n<p>Talvez eu migre para o <a href=\"https://pages.github.com/\" target=\"_blank\">Github Pages</a> usando <a href=\"https://jekyllrb.com/\" target=\"_blank\">Jekyll</a> o que pode me dar um trabalho imenso, pois nunca usei. Eu adoro linha de código e tudo mais, porém gostaria que essa experiência fosse um pouco mais fácil e visual, já que o restante está em muito mais código. Eu tentei achar algum Jekyll fácil por aí, com algum editor builtin ou algo completo num <a href=\"http://electron.atom.io/\" target=\"_blank\">Electron</a> da vida, mas sem sucesso. Eu posso editar os posts no Sublime ou algum editor de Markdown boladão, porém terei que aprender como funciona o Jekyll integralmente.</p>\n<p>O maior desafio é permanecer no Windows com essas ferramentas. Seria meu sonho se alguém fizesse um terminal decente pro Windows?</p>","frontmatter":{"title":"Mudança de host?","date":"December 11, 2016"}}},"pageContext":{"slug":"/2016-12-11-mudanca-de-host/","previous":{"fields":{"slug":"/2016-12-13-migrado-para-jekyll-github-pages/"},"frontmatter":{"title":"Migrado para o Jekyll e Github Pages"}},"next":null}}