{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"8125f20c-932c-520f-b12f-93259dbd5c9a","html":"<p>O principal do jogo pra mim é que a batalha seja divertida, bonita, bem pensada, organizada e com desafios. Decidi então fazer pelo menos que o básico não se pareça tanto com o padrão do RPG Maker.<!--more--></p>\n<p>Comecei com os menus de batalha:</p>\n<p><img src=\"./b3y3IFb.jpg\" alt=\"Menu de Batalha\"></p>\n<p>Minha inspiração principal foi o menu de Final Fantasy X, Final Fantasy XII e Dissidia Final Fantasy. Dá pra ver que acabou ficando muito mais próximo do X que do restante.</p>\n<p>{% include image name=“Bcx4p4u.png” %}</p>\n<p>O que está mais pronto é o layout do menu de atores e o layout do menu de Grupo, ali embaixo e à esquerda (ActorCommand e PartyCommand).</p>\n<p>O menu de poderes (Skill) ainda preciso resolver se ficará assim mesmo. Eu gostaria que o menu “Mochila” (Items) lembrasse o interior de uma mochila, mas não sei se conseguirei os recursos pra isso em tempo. Se os dois conseguirem ficar no mesmo estilo, eu vou deixá-los assim mesmo.</p>\n<p>{% include image name=“6dhoLW4.png” %}</p>\n<p>A tooltip do poder em si ainda não está boa (à direita), pois eu quero muito mais informações ali. Como estou capturando a <code class=\"language-text\">log_window</code> (ou seria <code class=\"language-text\">help_window</code>?) da <code class=\"language-text\">Scene_Battle</code> pra colocar esses dados, todas as informações da batalha estão indo ali. O ideal é criar uma <code class=\"language-text\">help_window</code> separada. Tenho a intenção também de fazer um plugin que leia as notetags de alguns dados extras, como Custo (energia, vida, especial, outra coisa?), Duração (se for melhoria, quanto tempo o alvo fica, em turnos), Recarga (Cooldown), Tempo de Lançamento (Cast Time), Alvo (1 inimigo, múltilpos inimigos, todos), etc - pra organizar e trazer a maior quantidade de informações possíveis sobre a magia. Parto do pressuposto que já que aquele personagem sabe lançar essa magia ele sabe muito bem sobre ela, certo? Isso terá que ser refletido também no menu principal das habilidades, quando aberto no mapa.</p>\n<p>Devo trabalhar nas barras laterais do Medidor de Grupo (Party Gauge) vertical nas laterais ainda e aquele ícone horrível que ficou no caminho, mas deve sair em breve. Minha intenção ali é usar uma imagem mais apelativa, mas como ainda não consigo programar isso direito é possível que saia primeiro uma organização melhor, depois a parte visual.</p>\n<p>Minha intenção é postar pelo menos 1 foto diferente da batalha por semana.</p>\n<p>Se tiver alguma sugestão, por favor, me envie!</p>","frontmatter":{"title":"Batalha - Visual, primeira versão","date":"December 07, 2016"}}},"pageContext":{"slug":"/2016-12-7-batalha-visual-primeira-versao/","previous":{"fields":{"slug":"/hi-folks/"},"frontmatter":{"title":"New Beginnings"}},"next":{"fields":{"slug":"/2017-02-18-personagens-coadjuvantes-e-racas/2017-02-18-personagens-coadjuvantes-e-racas/"},"frontmatter":{"title":"Personagens coadjuvantes e suas raças"}}}}