{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"fe36e1c5-3568-584f-aec9-d7c6d02335a8","html":"<p>Depois de quase 1 mês sem um post, resolvi que era hora de falar como anda o progresso do jogo. Justamente como a atualização aqui é importante que eu decidi postar que o progresso foi praticamente zero.</p>\n<p><em>Praticamente</em> é a palavra-chave ali porque o jogo em si está parado no RPG Maker MV, porém eu parti para outros projetos porque as limitações da ferramenta me fizeram parar pra pensar um pouco no por que e como estava fazendo o jogo.</p>\n<!--more-->\n<p>A primeira coisa que me chamou a atenção é a dificuldade de fazer uma interface interessante, como <a href=\"%7B%25%20post_url%202016-12-7-batalha-visual-primeira-versao%20%25%7D\">esses</a> <a href=\"%7B%25%20post_url%202016-12-9-apresentando-posicoes%20%25%7D\">posts</a> ilustraram bem. Não é preguiça de programar, é ficar o tempo todo olhando de volta como o framework do RPG Maker MV e <a href=\"http://www.pixijs.com/\">PIXI</a> funcionam. Isso leva um tempo considerável e o resultado é tão pequeno que acaba sendo encoberto por frustrações.</p>\n<h2>Mudança de paradigma</h2>\n<p>Um belo dia de dezembro um amigo meu conversou comigo sobre como ele estava migrando para a área de frontend e como era aprender JavaScript. Logo o assunto mudou e estávamos falando do Unity e jogos indies. E aí minha cabeça começou a viajar em como seria esse jogo feito em <a href=\"https://unity3d.com/\">Unity</a> e se o estilo RPG estava realmente dentro de um escopo alcançável.</p>\n<p>A resposta eu ainda não tenho, porém isso me abriu os olhos na quantidade de trabalho que posso fazer.</p>\n<h2>Aprendendo Unity</h2>\n<p>Enquanto eu não achava as respostas, fui fazendo alguns cursos online sobre o Unity e as possibilidades 2D que ele oferece. Acabei achando tanto material que fiquei abismado em como essa ferramenta cresceu desde que tive o primeiro contato com ela (perto da versão 2 ou 3 lá em 2011-2012). Hoje em dia, fazer jogos 2D com ela não parece mais uma grande gambiarra e o principal, eles ficam rápidos e relativamente fáceis de entender ao abrir um projeto. A comunidade é vibrante e não é fechada apenas a um <a href=\"http://forums.rpgmakerweb.com/\">fórum bem difícil de navegar</a> (sorry).</p>\n<p>Eu ainda estou longe de entender exatamente tudo como funciona lá dentro e, apesar de eu poder programar em JavaScript, a linguagem tem uma interpretação diferente (principalmente nos tipos!) e eu ainda não entendi bem como ela funciona por lá - tanto que abri mão e comecei a programar em C#. E isso vai me tirando cada vez mais de onde estava e me colocando em um lugar completamente diferente.</p>\n<h2>Questionando o gênero</h2>\n<p>Isso inclui o jogo em si. Me questionei muito sobre seu gênero: talvez um <a href=\"https://en.wikipedia.org/wiki/Metroidvania\">metroidvania</a> seria mais divertido? Ou um <a href=\"https://en.wikipedia.org/wiki/Roguelike\">roguelike</a>? Ou tudo junto? Eu gosto muito da ideia de evoluir num jogo, ganhar novos poderes, usá-los (ter utilidade!), etc… que são típicos de um RPG. Entretanto, eu não quero ficar preso mais a balões de textos e talvez menos ainda em batalhas por turno. Todos os grandes RPGs estão fugindo disso por um bom motivo, porém uma luta em tempo real é tão difícil quanto um jogo inteiro. Muitos jogos inteiros são só <em>hack-n-slash</em> por esse motivo.</p>\n<p>Enquanto divago sobre prossibilidades, continuo a ver mais sobre o Unity. Já aprendi muitas coisas sobre colisões, controles, cenas e até um framework maravilhoso chamado <a href=\"http://orkframework.com/\">ORK</a>, que eu possuo desde a versão 1 e não havia estudado até então. Pretendo continuar aqui por um tempo e isso fará o desenvolvimento dar uma sossegada por enquanto. De qualquer forma, pretendo vir aqui e falar do progresso, mesmo que não seja inteiramente relacionada ao Lumi. Ele vai sair, talvez não como RPG, talvez não no RPG Maker MV - mas vai!</p>","frontmatter":{"title":"Progresso atual","date":null}}},"pageContext":{"slug":"/2017-01-12-progresso-atual/","previous":{"fields":{"slug":"/2017-02-16-o-que-aprendi-e-bonus/"},"frontmatter":{"title":"O que aprendi + bônus!"}},"next":{"fields":{"slug":"/2016-12-7-batalha-visual-primeira-versao/"},"frontmatter":{"title":"Batalha - Visual, primeira versão"}}}}