{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"602f9504-b575-5fed-81ca-18ff11ac2457","html":"<p>Atenção! Esse é um post forçadão!</p>\n<p>Aconteceu o que eu temia: fiquei sem atualizar o blog por mais de 1 mês. Eu sei que pra quem lê essa é a frase mais chata <em>ever</em>. Mas esse blog é meu e eu faço com ele o que eu bem entender! <strong>HÁ!</strong></p>\n<!--more-->\n<p>Papo sério: aprender <a href=\"https://unity3d.com\">Unity</a> não é fácil. A interface é tranquila porque já havia <em>pegado o jeito</em> há alguns anos, lá atrás na versão 3. Porém aprender sobre o framework, os métodos, o que, onde, por que… são outros quinhentos. Fora a nova linguagem, C# que, apesar de bem parecida com JavaScript, <strong>não é JavaScript</strong>. Eu <a href=\"%7B%25%20post_url%202017-01-12-progresso-atual%20%25%7D\">tentei</a> programar por lá em JavaScript, porém o negócio deles é diferente e o que conheço da linguagem como válida, lá é um outro <em>trem</em>. E reaprender o JavaScript deles pra mim é o mesmo que aprender outra linguagem. Então C# é o negócio!</p>\n<p>O que pega também é que estou fazendo um jogo 2D e a interface do Unity tem tanto suporte a 3D que fica tudo um pouco confuso. A começar pela câmera, que às vezes é uma salada pra se movimentar. Outra coisa é o suporte a sprites, que parece simples, mas dá uns bugs de renderização que requerem uns hacks manuais, <a href=\"http://answers.unity3d.com/questions/609736/gaps-sometimes-appearing-between-2d-sprites.html\">como esse daqui</a>. Esses hacks me fazem questionar se a ferramenta está mesmo preparada para o 2D.</p>\n<h2>Devaneios</h2>\n<p>Como sou bem multimídia e deixo os devaneios me levarem onde eles quiserem por conta desse calor insano dessa cidade (uau, essa reclamação foi muito além do que eu esperava!) eu também resolvi pegar mais 2 projetos em paralelo. Um deles é um app para um amigo que não posso falar a respeito, feito em frontend web: JavaScript, HTML, CSS e aqueles frameworks deliciosos que tem por aí. O outro é aprender um framework frontend, tanto pra esse projeto quanto pro meu currículo: o <a href=\"https://vuejs.org\">Vue</a> (se pronuncia como a palavra em inglês <em>view</em>). Ele me chamou a atenção por 2 motivos: não é Angular e não é React. Eu desenvolvi muita coisa nos últimos anos em Angular e ele mora no meu coração, porém é um <em>trem</em> pesado à beça e a versão 2 é muito pra minha cabeça. React parece lindo e maravilhoso, mas tem algo no time do Facebook que não me agrada e aí o <del>preconceito</del> instinto bate forte. Eu sei que ainda terei que aprender React um dia, mas estou me divertindo com o Vue e achando mais poderoso que qualquer coisa. Em tempo: <a href=\"https://facebook.github.io/react/docs/jsx-in-depth.html\">JSX</a> é a coisa mais deliciosa que já inventaram.</p>\n<p>Enfim, fiz um parágrafo imenso que não tem nada a ver com o jogo. Fiz porque esse é um post forçadão, eu avisei!</p>\n<h2>Bônus!</h2>\n<p>Mas e o tal bônus? Ah, sim! Eu tive mais uma ideias para um personagem. O Alvaro (que já foi Zero e Antonio), o único humano do time da Lumi e seu guarda-costas oficial a pedido da mãe, terá um poder esquisito em algum momento da história. Ele poderá <em>retomar sua juventude</em> e, nessa forma, ele deixa de ser ranzinza pra ser um baita boca suja. Fica mais atiradão, mais nervoso e xinga tudo que vê. A princípio, pro jogo permanecer familiar <small>(ou seja, crianças poderem jogar e eu não ser xingado por mães por aí)</small>, eu pensei no xingamento ser uma palavra com o som parecido ao xingamento, mas não ser ele em si. Uma espécie de auto-censura <a href=\"https://en.wikipedia.org/wiki/Frak_(expletive)\">como fazem em Battlestar Galactica</a> e tantos outros por aí. Eu gostei tanto dessa ideia que já imaginei cenas onde usar e tudo mais.</p>\n<p>Falando nisso, esse é um outro tópico que eu deveria logar por aqui: os personagens, suas motivações e suas histórias. Mas vou deixar isso pra outro post. No fundo, eu tenho um certo receio de alguém copiar, mas analisando bem, é parte da proposta desse site - eu não posso impedir cópias, eu não sei se quero e se alguém usar eu considero que minha ideia foi boa o bastante pra tal! :)</p>\n<p>É isso por agora. Aproveitei todo o café nesse texto, porém vou lá desenvolver mais um pouco pra ter o que postar aqui <del>ainda essa semana</del> em breve!</p>","frontmatter":{"title":"O que aprendi + bônus!","date":null}}},"pageContext":{"slug":"/2017-02-16-o-que-aprendi-e-bonus/","previous":{"fields":{"slug":"/2016-12-7-batalha-visual-primeira-versao/"},"frontmatter":{"title":"Batalha - Visual, primeira versão"}},"next":{"fields":{"slug":"/2017-01-12-progresso-atual/"},"frontmatter":{"title":"Progresso atual"}}}}